package task_3;


/** Дана строка json:

 [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"}, {"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
 {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]

 Написать метод, который распарсит json и, используя StringBuilder, создаст строки вида:

 Студент [фамилия] получил [оценка] по предмету [предмет]. Например:

 Студент Иванов получил 5 по предмету Математика.
 Студент Петрова получил 4 по предмету Информатика.
 Студент Краснов получил 5 по предмету Физика. */


public class GetParsing {
    public static void main(String[] args) {
        // Исходная строка
        String parameters = "{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}," +
                " {\"фамилия\":\"Петрова\",\"оценка\":\"5\",\"предмет\":\"Информатика\"}," +
                " {\"фамилия\":\"Краснов\",\"оценка\":\"3\",\"предмет\":\"Физика\"}";

        String[] parameters_massive = parameters.replaceAll("\"", "").split("[}, {]");
        for (String s : parameters_massive) {
            System.out.println(s);
        }

        }
    }
